section_dividers = ["⌔︙", "❖︙", "✦︙", "✾︙", "✤︙"] # فواصل مميزة للمقاطع 
bullets = ["◆", "✿", "❀", "✦", "•", "❖"] # نقطة ماسية 

loading_bar = "▁ ▂ ▄ ▅ ▆ ▇ █" # شريط تحميل أو تقدم 
twinkle_line = "✦ ✧ ✦" # خط مزين بالنجوم 
vertical_separator = '│' # فاصل عمودي 
ayah_divider = '۝' # فاصل آية قرآنية 
# رموز الآية
AYAH_LEFT  = "﴿"
AYAH_RIGHT = "﴾"

post_divider = '%%' # فاصل منشورات 

happy_cheer = ["٩(◕‿◕｡)۶", "( ͡° ͜ʖ ͡°)", "(ง'̀-'́)ง"]
lines = [
  "‏═══════════════════",
  "‏• ────── ✾ ────── •",
  "‏────────── • ✤ • ──────────",
  "‏• — • — • — •",
  "‏• ━━━━━━━━━━━━ •",
  "‏┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄",
  "‏—————————————",
  "‏• ──── ✿ ──── •",
  "‏━━━━━━━━━━━━━━━",
  "‏• ━━━━━━━━━━━━━━━ •"
  ]


left_arrows = ["←", "⇚", "↫", "↢", "↤", "↞", "⭅", "⬿", "⬸", "⬳", "⬱", "⤶", "⟻", "↵", "⇦", "⇤", "⇠", "↼", "↲", "↰"]

right_arrows = ["➤", "↬", "⇢", "➤", "➲", '╰─>', "↣", "↠", "⭆", "⤷", "⟼", "➞", "➙", "⇨", "⇥", "⇀", "↳", "↱","↦"] 

success_icons = ["✅","✔️", "☑️"]
error_icons = ["❎", "❌", "✖️"]
waiting_icon = ["⏳"]
warning_icon = ["⚠️"]
next_icon = ["⏭️"]
prev_icon = ["⏮️"]



